app/views/profiles/show.html.slim

        tbody
          - i = @user.transactions.count + 1
          - @user.transactions.each do |t|
---
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."user_id" = 1
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = 1