app/views/welcome/index.html.slim

    ul.scroll
      - User.find(:all, :limit=> 20, :order=> 'RANDOM()').each do |user|
---
SELECT "users".* FROM "users" WHERE (nickname ~* 'GiyazovAV') LIMIT 1

  /     ul.scroll
  /       - page_stream.users.each do |user|
---
SELECT "users".* FROM "users" ORDER BY share_price desc LIMIT 10 OFFSET 10