app/controllers/profiles_controller.rb

INSERT INTO "users" ("avatar", "base_price", "created_at", "last_update", "money", "name", "nickname", "retention_shares", "share_price", "shares", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT "users".* FROM "users" WHERE (nickname ~* 'postskolkovo') LIMIT 1
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."user_id" = 1
---
  def show
    @user = User.find_or_create(params[:id])

    unless @user
      return redirect_to not_found_path
    end

    #'sell' starting stocks
    if @user.has_starting_stocks
      @user.sell_starting_stocks
    end


    @my_page  = (@user == current_user)

    #Определяем популярность пользователя
    @popularity = Transaction.where(:owner_id=>@user.id).where("created_at >= :time", {:time => Time.now - 42000}).count