app/controllers/session_controller.rb

INSERT INTO "users" ("avatar", "base_price", "created_at", "last_update", "money", "name", "nickname", "retention_shares", "share_price", "shares", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
UPDATE "users" SET "last_update" = '2012-05-26 18:30:36.753856', "updated_at" = '2012-05-26 18:30:36.754364' WHERE "users"."id" = 1
---
  def create
    auth = request.env['omniauth.auth']

    unless @user = User.try_to_find(auth.uid)
      @user = User.create_from_twitter_oauth(auth)
    end

    if (not @user.token? or not @user.secret?)
      @user.update_from_twitter_oauth(auth)