app/controllers/shares_controller.rb

SELECT "users".* FROM "users" WHERE (nickname ~* 'GiyazovAV') LIMIT 1
---
  def buy
    p = params[:buy]
    owner = User.find_by_nickname(p[:owner])

SELECT "users".* FROM "users" WHERE (nickname ~* 'GiyazovAV') LIMIT 1
---
  def sell
    p = params[:sell]
    owner = User.find_by_nickname(p[:owner])