app/controllers/welcome_controller.rb

SELECT "users".* FROM "users" ORDER BY share_price desc LIMIT 10 OFFSET 10
---
  def index
    @celebrities    = User.find_by_nicknames(CELEBRITIES_NAMES, shuffle: true, limit: MAX_USERS_PER_PAGE, history: true)
    @politicians    = User.find_by_nicknames(POLITICIANS_NAMES, shuffle: true, limit: MAX_USERS_PER_PAGE, history: true)
    @random         = User.includes(:history).random(MAX_USERS_PER_PAGE)